#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/AwsLambdaDotnetWebApi/AwsLambdaDotnetWebApi/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/AwsLambdaDotnetWebApi/AwsLambdaDotnetWebApi

To view this run in a browser, visit:
https://app.terraform.io/app/personal-burrt/template-github-actions/runs/run-CXUozKsssuG5Pha2

Waiting for the plan to start...

Terraform v1.10.5
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.network: Refreshing...
data.terraform_remote_state.network: Refresh complete after 1s
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named
│ "TF_VAR_lambda_dotnet_redis_user_password" but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-CXUozKsssuG5Pha2/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.lambda-dotnet-web-api-policy will be created
  + resource "aws_iam_policy" "lambda-dotnet-web-api-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policies for the .NET Web API Lambda"
      + id               = (known after apply)
      + name             = "lambda-dotnet-web-api-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AWSLambdaBasicExecutionRole"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeSubnets",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:AssignPrivateIpAddresses",
                          + "ec2:UnassignPrivateIpAddresses",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AWSLambdaVPCAccessExecutionPermissions"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:ap-southeast-2:398018169858:secret:templates/AwsLambdaDotnetWebApi/redis-user-secret*"
                      + Sid      = "AWSSecretsManagerReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.lambda-dotnet-web-api-role will be created
  + resource "aws_iam_role" "lambda-dotnet-web-api-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-dotnet-web-api-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda-dotnet-web-api-role-policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda-dotnet-web-api-role-policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda-dotnet-web-api-role"
    }

  # aws_lambda_function.aws_lambda_dotnet_web_api will be created
  + resource "aws_lambda_function" "aws_lambda_dotnet_web_api" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../build/lambda_package.zip"
      + function_name                  = "AwsLambdaDotnetWebApi"
      + handler                        = "AwsLambdaDotnetWebApi::AwsLambdaDotnetWebApi.LambdaEntryPoint::FunctionHandlerAsync"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "dotnet8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "UVsyTMYd+qtFcHSZy+4GW5b2r+U9RlPq6aUnx12Bt20="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "GIT_COMMIT" = "TODO"
        }
      + tags_all                       = {
          + "GIT_COMMIT" = "TODO"
        }
      + timeout                        = 5
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ASPNETCORE_ENVIRONMENT" = "Production"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-03d9b53f94fa24f08",
            ]
          + subnet_ids                  = [
              + "subnet-062c6a84ba4995137",
              + "subnet-0b0e95e55ed0ce739",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_permission.api-gateway-lambda-invoke-perm will be created
  + resource "aws_lambda_permission" "api-gateway-lambda-invoke-perm" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "AwsLambdaDotnetWebApi"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-2:398018169858:2wwtpu9vd1/*/*/{proxy+}"
      + statement_id        = "AllowApiGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # aws_secretsmanager_secret.sm-redis-user-secret will be created
  + resource "aws_secretsmanager_secret" "sm-redis-user-secret" {
      + arn                            = (known after apply)
      + description                    = "Redis user secret for the .NET Web API Lambda"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "templates/AwsLambdaDotnetWebApi/redis-user-secret"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # aws_secretsmanager_secret_version.sm-redis-user-secret will be created
  + resource "aws_secretsmanager_secret_version" "sm-redis-user-secret" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @burrt, Action: `pull_request`, Working Directory: ``, Workflow: `CI/CD`*